import React from 'react';

const PrivacyPolicy: React.FC = () => (
  <div>
    Любая информация, представленная на данном сайте, носит исключительно
    информационный характер и ни при каких условиях не является публичной
    офертой, определяемой положениями статьи 437 ГК РФ. Отправляя сведения через
    любую электронную форму на этом сайте, вы даете согласие на обработку ваших
    персональных данных.
    <h3>Соглашение на обработку персональных данных.</h3>
    Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных
    данных» от 27.07.2006 года Вы подтверждаете свое согласие на обработку
    сайтом zhilischnoe-pravo.ru персональных данных: сбор, систематизацию,
    накопление, хранение, уточнение (обновление, изменение), использование,
    передачу исключительно в целях продажи программного обеспечения на Ваше имя,
    как это описано ниже, блокирование, обезличивание, уничтожение. Сайт
    zhilischnoe-pravo.ru гарантирует конфиденциальность получаемой информации.
    Обработка персональных данных осуществляется в целях эффективного исполнения
    заказов, договоров и иных обязательств, принятых сайтом zhilischnoe-pravo.ru
    в качестве обязательных к исполнению. В случае необходимости предоставления
    Ваших персональных данных правообладателю, дистрибьютору или реселлеру
    программного обеспечения в целях регистрации программного обеспечения на
    ваше имя, вы даёте согласие на передачу ваших персональных данных. Сайт
    zhilischnoe-pravo.ru гарантирует, что правообладатель, дистрибьютор или
    реселлер программного обеспечения осуществляет защиту персональных данных на
    условиях, аналогичных изложенным в Политике конфиденциальности персональных
    данных. Настоящее согласие распространяется на следующие Ваши персональные
    данные: фамилия, имя и отчество, адрес электронной почты, почтовый адрес
    доставки заказов, контактный телефон, платёжные реквизиты. Срок действия
    согласия является неограниченным. Вы можете в любой момент отозвать
    настоящее согласие, направив письменное уведомление на адрес:
    admin@zhilischnoe-pravo.ru с пометкой «Отзыв согласия на обработку
    персональных данных». Обращаем ваше внимание, что отзыв согласия на
    обработку персональных данных влечёт за собой удаление Вашей учётной записи
    с Интернет-сайта zhilischnoe-pravo.ru, а также уничтожение записей,
    содержащих ваши персональные данные, в системах обработки персональных
    данных на сайте zhilischnoe-pravo.ru, что может сделать невозможным
    пользование интернет-сервисами zhilischnoe-pravo.ru. Гарантирую, что
    представленная мной информация является полной, точной и достоверной, а
    также что при представлении информации не нарушаются действующее
    законодательство Российской Федерации, законные права и интересы третьих
    лиц. Вся представленная информация заполнена мною в отношении себя лично.
    Настоящее согласие действует в течение всего периода хранения персональных
    данных, если иное не предусмотрено законодательством Российской Федерации.
  </div>
);

export default PrivacyPolicy;
